app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE (nextActivationDate <= ('2012-08-20 23:34:28.082492'))
---
  def index
    @tasks = Task.all

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @task = Task.find(params[:id])

INSERT INTO "tasks" ("completed", "created_at", "lastReminderDelay", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["completed", false], ["created_at", Sun, 19 Aug 2012 22:58:06 UTC +00:00], ["lastReminderDelay", 4], ["name", "Android"], ["updated_at", Sun, 19 Aug 2012 22:58:06 UTC +00:00]]
---
  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 2]]
---
  def destroy
    @task = Task.find(params[:id])
    @task.destroy

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "tasks" SET "completed" = 't', "updated_at" = '2012-08-25 01:43:03.859505' WHERE "tasks"."id" = 8
---
  def update
    Rails.logger.info("PARAMS: #{params.inspect}")
    @task = Task.find(params[:id])

    #This contruct could probably use some work
    #and alternatively i could have used another url
    #like /tasks/1/complete . Not sure if using post variables
    #is better
    if params[:completed].to_i == 1
      @task.completed = true
      @task.save()